### 이번 9장에서는 아래와 같은 내용을 배우게 된다.
- 하나 이상의 키(함수, 배열, DataFrame의 컬럼 이름)를 이용해서 pandas 객체를 여러 조각으로 나누는 방법
- 합계, 평균, 표준편차, 사용자 정의 함수를 적용하는 방법
- 정규화, 선형 회귀, 등급 또는 부분집합 선택 같은 집단 내 변형이나 다른 조작을 적용하는 방법
- 피벗 테이블과 교차일람표를 구하는 방법
- 변위치 분석과 다른 데이터 파생 집단 분석을 수행하는 방법

#### Groupby 메카닉
그룹의 색인은 다양한 형태가 될 수 있으며, 모두 같은 타입일 필요도 없다.
- 그룹으로 묶을 축과 같은 길이의 리스트나 배열
- DataFrame의 컬럼 이름을 지칭하는 값
- 그룹으로 묶을 값과 그룹 이름에 대응하는 사전이나 Series 객체
- 축 색인 혹은 색인 내의 개별 이름에 대해 실행되는 함수

위 목록에서 마지막 세가지 방법은 모두 객체는 나눌때 사용할 배열을 생성하기 위한 방법이다.<br/>
아직 확싱한 개념이 잡히지 않는다고 걱정할필요 없다.<br/>

In [1]:
df = pd.DataFrame({'key1':['a','a','b','b','a'],
                  'key2':['one','two','one','two','one'],
                  'data1':np.random.randn(5),
                  'data2':np.random.randn(5)})

In [2]:
df

      data1     data2 key1 key2
0 -1.258127  0.562692    a  one
1  0.761373  0.524920    a  two
2  0.402668 -1.212386    b  one
3  0.194717 -0.024926    b  two
4 -1.072230  1.489523    a  one

In [4]:
grouped = df['data1'].groupby(df['key1'])

In [5]:
grouped

이 grouped 변수는 *groupby* 객체다. df['key1']로 참조되는 중간 값에 대한 것 외에는 아무것도 계산되지 않은 객체다.<br/>
이 객체는 그룹 연산을 위해 필요한 모든 정보를 가지고 있기 때문에 각 그룹에 어떤 연산을 적용할 수 있게 해준다.

In [6]:
grouped.mean()

key1
a   -0.522995
b    0.298692
Name: data1, dtype: float64

In [18]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()

In [19]:
means #Series

key1  key2
a     one    -1.165178
      two     0.761373
b     one     0.402668
      two     0.194717
Name: data1, dtype: float64

In [20]:
pd.DataFrame(means)

              data1
key1 key2
a    one  -1.165178
     two   0.761373
b    one   0.402668
     two   0.194717

In [21]:
means.unstack()

key2       one       two
key1
a    -1.165178  0.761373
b     0.402668  0.194717

In [34]:
states = np.array(['seoul','jeju','jeju','seoul','seoul'])

In [35]:
years = np.array([2005,2005,2006,2005,2006])

In [36]:
df

      data1     data2 key1 key2
0 -1.258127  0.562692    a  one
1  0.761373  0.524920    a  two
2  0.402668 -1.212386    b  one
3  0.194717 -0.024926    b  two
4 -1.072230  1.489523    a  one

In [37]:
df['data1'].groupby([states,years]).mean()

jeju   2005    0.761373
       2006    0.402668
seoul  2005   -0.531705
       2006   -1.072230
Name: data1, dtype: float64

In [41]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.522995  0.859045
b     0.298692 -0.618656

In [42]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -1.165178  1.026108
     two   0.761373  0.524920
b    one   0.402668 -1.212386
     two   0.194717 -0.024926

In [43]:
df.groupby(['key1','key2']).mean().unstack()

         data1               data2
key2       one       two       one       two
key1
a    -1.165178  0.761373  1.026108  0.524920
b     0.402668  0.194717 -1.212386 -0.024926

In [46]:
df

      data1     data2 key1 key2
0 -1.258127  0.562692    a  one
1  0.761373  0.524920    a  two
2  0.402668 -1.212386    b  one
3  0.194717 -0.024926    b  two
4 -1.072230  1.489523    a  one

In [44]:
df.groupby(['key1','key2'])

In [45]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64